---
title: ValueParsingOptions
classe: Autodesk.Revit.DB.ValueParsingOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ValueParsingOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AllowedValues AllowedValues { get; set; }` | `valueParsingOptions.AllowedValues` | AllowedValues |
| `Boolean IsValidObject { get; }` | `valueParsingOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `valueParsingOptions.Dispose()` | Void |
| `FormatOptions GetFormatOptions()` | `valueParsingOptions.GetFormatOptions()` | FormatOptions |
| `Void SetFormatOptions(FormatOptions)` | `valueParsingOptions.SetFormatOptions(formatOptions)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```